; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	spectrograph2 - mode
	image1 - mode
	spectrograph4 - mode
	infrared3 - mode
	thermograph5 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph5)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument2 spectrograph4)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 infrared3)
	(supports instrument7 image1)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star4)
	(supports instrument9 infrared3)
	(calibration_target instrument9 GroundStation3)
	(supports instrument10 spectrograph2)
	(supports instrument10 infrared3)
	(supports instrument10 spectrograph4)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet8)
	(supports instrument11 thermograph5)
	(calibration_target instrument11 GroundStation2)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star4)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(pointing satellite4 Star10)
	(pointing satellite5 Planet5)
	(have_image Planet5 image1)
	(have_image Planet6 spectrograph4)
	(have_image Planet6 infrared3)
	(have_image Phenomenon7 infrared3)
	(have_image Planet8 image1)
	(have_image Phenomenon9 spectrograph2)
	(have_image Phenomenon9 spectrograph4)
	(have_image Star10 thermograph5)
	(have_image Star11 image1)
	(have_image Star11 spectrograph2)
))

)

; plan
1. (turn_to satellite5 planet5 star4)
   deleted: (pointing satellite5 star4)
   added: (pointing satellite5 planet5)
   goals met: 1 of 13
2. (turn_to satellite4 star10 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star10)
   goals met: 2 of 13
3. (turn_to satellite1 groundstation1 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation1)
   goals met: 2 of 13
4. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 13
5. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 2 of 13
6. (turn_to satellite1 phenomenon9 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 13
7. (take_image satellite1 phenomenon9 instrument2 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 3 of 13
8. (take_image satellite1 phenomenon9 instrument2 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 4 of 13
9. (turn_to satellite1 phenomenon7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 13
10. (turn_to satellite0 groundstation0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 13
11. (take_image satellite1 phenomenon7 instrument2 infrared3)
   added: (have_image phenomenon7 infrared3)
   goals met: 5 of 13
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 13
13. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 5 of 13
14. (turn_to satellite0 planet5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet5)
   goals met: 5 of 13
15. (take_image satellite0 planet5 instrument0 image1)
   added: (have_image planet5 image1)
   goals met: 6 of 13
16. (turn_to satellite0 planet8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet8)
   goals met: 6 of 13
17. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 7 of 13
18. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 7 of 13
19. (take_image satellite0 star10 instrument0 thermograph5)
   added: (have_image star10 thermograph5)
   goals met: 8 of 13
20. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 8 of 13
21. (take_image satellite0 star11 instrument0 image1)
   added: (have_image star11 image1)
   goals met: 9 of 13
22. (turn_to satellite0 phenomenon9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon9)
   goals met: 10 of 13
23. (turn_to satellite1 planet6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet6)
   goals met: 10 of 13
24. (take_image satellite1 planet6 instrument2 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 11 of 13
25. (take_image satellite1 planet6 instrument2 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 12 of 13
26. (turn_to satellite1 star11 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star11)
   goals met: 12 of 13
27. (take_image satellite1 star11 instrument2 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 13 of 13
